name: "preprocess"
backend: "python"

max_batch_size: 16
input [
  {
    name: "raw_image"
    data_type: TYPE_UINT8
    dims: [-1] 
  }
]

output [
    {
      name: "preprocessed_image"
      data_type: TYPE_FP32 
      dims: [3, -1, -1]
    }
]

instance_group { kind: KIND_CPU }