name: "preprocess"
backend: "python"

max_batch_size: 1

input [
  {
    name: "raw_image"
    data_type: TYPE_UINT8
    dims: [-1] 
  }
]

output [
    {
      name: "preprocessed_image"
      data_type: TYPE_FP32 
      dims: [3, -1, -1]
    }
]

dynamic_batching {
  max_queue_delay_microseconds: 150
}

instance_group {
  count: 1
  kind: KIND_CPU
}