name: "preprocessing"
backend: "python"

input [
  {
    name: "input_image"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  }
]

output [
  {
    name: "preprocessed_image"
    data_type: TYPE_FP32
    dims: [ 1, 3, 640, 640 ]
  }
]

max_batch_size: 16
