name: "yolov8s"
max_batch_size: 1
input {
  name: "images"
  data_type: TYPE_FP32
  dims: 3
  dims: -1
  dims: -1
}
output {
  name: "output0"
  data_type: TYPE_FP32
  dims: 5
  dims: -1
}
instance_group {
  count: 2
  kind: KIND_CPU
}
default_model_filename: "model.onnx"
dynamic_batching {
  max_queue_delay_microseconds: 500
}
optimization {
  input_pinned_memory {
    enable: true
  }
  output_pinned_memory {
    enable: true
  }
}
backend: "onnxruntime"
